In [249]:
# se importa el conector de snowflake
import snowflake.connector 
# se importa del modulo de swnoflake la herramienta de pandas para ingestar un dataframe a una tabla de snowflake
from snowflake.connector.pandas_tools import write_pandas 
import pandas as pd
import wbgapi as wb
from sklearn import preprocessing
import streamlit as st
import snowflake.connector
import pickle

### Se crea la conexión con snowflake

In [298]:
#se crea conexión
conn = snowflake.connector.connect(
    user='grupods03',
    password='Henry2022#',
    account='nr28668.sa-east-1.aws')
    #warehouse='PRUEBA',
    #role ='ACCOUNTADMIN',
    #schema ='PUBLIC')

2022-10-25 00:47:00.966 Snowflake Connector for Python Version: 2.8.0, Python Version: 3.10.5, Platform: Windows-10-10.0.19044-SP0
2022-10-25 00:47:00.969 This connection is in OCSP Fail Open Mode. TLS Certificates would be checked for validity and revocation status. Any other Certificate Revocation related exceptions or OCSP Responder failures would be disregarded in favor of connectivity.

In [299]:
def execute_query(connection, query):
    cursor = connection.cursor() # se inicializa la conexión Creates a cursor object. Each statement will be executed in a new cursor object.
    cursor.execute(query)
    cursor.close()

### Se crea la database y el datawarehouse

In [ ]:
query = "Create database LAKE" # se crea database

execute_query(conn, query)

In [300]:
query = "Use database LAKE" # se inicializa database

execute_query(conn, query)

2022-10-25 00:47:08.510 query: [Use database LAKE]
2022-10-25 00:47:08.834 query execution done
2022-10-25 00:47:08.837 Number of results in first chunk: 1

In [ ]:
query = "Create warehouse DW_EV" # se crea un datawarehouse dentro de LAKE

execute_query(conn, query)

In [301]:
query = "Use warehouse DW_EV" # se inicializa datawarehouse

execute_query(conn, query)

2022-10-25 00:47:11.768 query: [Use warehouse DW_EV]
2022-10-25 00:47:12.077 query execution done
2022-10-25 00:47:12.080 Number of results in first chunk: 1

### Creamos las tablas y sus relaciones

In [194]:
'''Cuando queremos borrar una tabla
viewquery ="""
    DROP TABLE EV;
    """ # se borra la tabla INCOME

execute_query(conn, viewquery)
'''

In [302]:
viewquery ="""
    create or replace TABLE PAIS (
	CODIGO_PAIS VARCHAR(3) NOT NULL,
	ID_PAIS INT NOT NULL,
	NOMBRE VARCHAR(30) NOT NULL,
	constraint PKEY_1 primary key (ID_PAIS)
    );""" # se crea la tabla PAIS

execute_query(conn, viewquery)

2022-10-25 00:47:36.333 query: [create or replace TABLE PAIS ( CODIGO_PAIS VARCHAR(3) NOT NULL, ID_PAIS INT NOT ...]
2022-10-25 00:47:36.806 query execution done
2022-10-25 00:47:36.808 Number of results in first chunk: 1

In [303]:
viewquery ="""
    create or replace TABLE CONTINENTE (
	ID_CONTINENTE INT NOT NULL,
	CONTINENTE VARCHAR(20) NOT NULL,
	constraint PKEY_1 primary key (ID_CONTINENTE)
    );""" # se crea la tabla CONTINENTE

execute_query(conn, viewquery)

2022-10-25 00:47:39.743 query: [create or replace TABLE CONTINENTE ( ID_CONTINENTE INT NOT NULL, CONTINENTE VARC...]
2022-10-25 00:47:40.253 query execution done
2022-10-25 00:47:40.255 Number of results in first chunk: 1

In [304]:
viewquery ="""
    create or replace TABLE INDICADOR (
	ID_INDICADOR INT NOT NULL,
	CODIGO VARCHAR(20) NOT NULL,
	DESCRIPCION VARCHAR(16777216),
	constraint PKEY_1 primary key (ID_INDICADOR)
    );""" # se crea la tabla INDICADOR

execute_query(conn, viewquery)

2022-10-25 00:47:43.177 query: [create or replace TABLE INDICADOR ( ID_INDICADOR INT NOT NULL, CODIGO VARCHAR(20...]
2022-10-25 00:47:43.637 query execution done
2022-10-25 00:47:43.640 Number of results in first chunk: 1

In [305]:
viewquery ="""
    create or replace TABLE INCOME (
	CODIGO_INCOME VARCHAR(2) NOT NULL,
	ID_INCOME INT NOT NULL,
	INCOME VARCHAR(30),
	constraint PKEY_1 primary key (ID_INCOME)
    );""" # se crea la tabla INCOME

execute_query(conn, viewquery)

2022-10-25 00:47:48.634 query: [create or replace TABLE INCOME ( CODIGO_INCOME VARCHAR(2) NOT NULL, ID_INCOME IN...]
2022-10-25 00:47:49.111 query execution done
2022-10-25 00:47:49.113 Number of results in first chunk: 1

In [306]:
viewquery ="""
    create or replace TABLE EV (
	ID_PAIS INT NOT NULL,
	ID_CONTINENTE INT NOT NULL,
	ID_INDICADOR INT  NOT NULL,
	ID_INCOME INT NOT NULL,
	ANIO INTEGER NOT NULL,
	VALOR FLOAT,
	constraint FKEY_1 foreign key (ID_PAIS) references PAIS(ID_PAIS),
	constraint FKEY_2 foreign key (ID_CONTINENTE) references CONTINENTE(ID_CONTINENTE),
	constraint FKEY_3 foreign key (ID_INDICADOR) references INDICADOR(ID_INDICADOR),
	constraint FKEY_4 foreign key (ID_INCOME) references INCOME(ID_INCOME)
    );""" # se crea la tabla de hechos EV

execute_query(conn, viewquery)

2022-10-25 00:47:53.138 query: [create or replace TABLE EV ( ID_PAIS INT NOT NULL, ID_CONTINENTE INT NOT NULL, I...]
2022-10-25 00:47:53.759 query execution done
2022-10-25 00:47:53.761 Number of results in first chunk: 1

### Cargamos datos a las tablas dimensionales

Cargamos datos en la tabla continente

In [307]:
Continentes=['America','Europa','Asia','Africa','Oceania']
df=pd.DataFrame({"CONTINENTE":Continentes})

#Se codifica ID_PAIS a partir de CODIGO_PAIS
le_conti = LabelEncoder()
le_conti.fit(df['CONTINENTE'])
df['ID_CONTINENTE'] = le_conti.transform(df['CONTINENTE'])

#Se guarda la codificación
filehandler = open("le_conti.obj","wb")
pickle.dump(le_conti,filehandler)
filehandler.close()
 
write_pandas(conn, df, 'CONTINENTE') # se ingesta el dataframe pd a la tabla Continente

2022-10-25 00:47:58.406 query: [create temporary stage /* Python:snowflake.connector.pandas_tools.write_pandas()...]
2022-10-25 00:47:58.790 query execution done
2022-10-25 00:47:58.792 Number of results in first chunk: 1
2022-10-25 00:47:58.802 query: [PUT /* Python:snowflake.connector.pandas_tools.write_pandas() */ 'file://C:\\Use...]
2022-10-25 00:47:59.182 query execution done
2022-10-25 00:48:01.769 query: [COPY INTO "CONTINENTE" /* Python:snowflake.connector.pandas_tools.write_pandas()...]
2022-10-25 00:48:03.276 query execution done
2022-10-25 00:48:03.278 Number of results in first chunk: 1

(True,
 1,
 5,
 [('fqgrm/file0.txt', 'LOADED', 5, 5, 1, 0, None, None, None, None)])

In [ ]:
#Esto es un ejemplo de como reutilizar el labelencoder
Continentesx2=['America','America','Europa','Europa','Asia','Asia','Africa','Africa','Oceania','Oceania']
dfx2=pd.DataFrame({"CONTINENTE":Continentesx2})

file = open("le_conti.obj",'rb')
le_loaded = pickle.load(file)
file.close()
 
dfx2['ID_Continentes'] = le_loaded.transform(dfx2['CONTINENTE'])

dfx2

Cargamos datos en la tabla PAIS

In [308]:
Nation = ['United States', 'Canada','Mexico','Costa Rica','Panama','Brazil','Argentina','Chile','Uruguay','Bolivia','Peru','Egypt, Arab Rep.','Libya','South Africa','Nigeria','Morocco','Australia','China','India','Thailand','Japan','Korea, Rep.','Israel','Saudi Arabia','Malaysia','Indonesia','Russian Federation','Turkiye','Spain','Bulgaria','France','Italy','Germany','United Kingdom','Norway','Sweden','Greece']
Nation_code= ['USA','CAN','MEX','CRI','PAN','BRA','ARG','CHL','URY','BOL','PER','EGY','LBY','ZAF','NGA','MAR','AUS','CHN','IND','THA','JPN','KOR','ISR','SAU','MYS','IDN','RUS','TUR','ESP','BGR','FRA','ITA','DEU','GBR','NOR','SWE','GRC']
df=pd.DataFrame({'CODIGO_PAIS':Nation_code,'NOMBRE': Nation}) #Creamos el dataframe para PAIS

#Se codifica ID_PAIS a partir de CODIGO_PAIS
le_nation = LabelEncoder()
le_nation.fit(df['CODIGO_PAIS'])
df['ID_PAIS'] = le_nation.transform(df['CODIGO_PAIS'])

#Se guarda la codificación
filehandler = open("le_nation.obj","wb")
pickle.dump(le_nation,filehandler)
filehandler.close()

write_pandas(conn, df, 'PAIS') # se ingesta el dataframe pd a la tabla pais

2022-10-25 00:48:09.811 query: [create temporary stage /* Python:snowflake.connector.pandas_tools.write_pandas()...]
2022-10-25 00:48:10.185 query execution done
2022-10-25 00:48:10.186 Number of results in first chunk: 1
2022-10-25 00:48:10.200 query: [PUT /* Python:snowflake.connector.pandas_tools.write_pandas() */ 'file://C:\\Use...]
2022-10-25 00:48:10.583 query execution done
2022-10-25 00:48:13.024 query: [COPY INTO "PAIS" /* Python:snowflake.connector.pandas_tools.write_pandas() */ ("...]
2022-10-25 00:48:14.603 query execution done
2022-10-25 00:48:14.605 Number of results in first chunk: 1

(True,
 1,
 37,
 [('fnfyo/file0.txt', 'LOADED', 37, 37, 1, 0, None, None, None, None)])

Cargamos datos en la tabla INCOME

In [309]:
Income=['Alto ingreso','Ingreso medio alto','Ingreso medio bajo']
CODIGO_INC=['H','M','LM']
df = pd.DataFrame({'INCOME':Income, 'CODIGO_INCOME':CODIGO_INC}) #Se crea el dataframe para INCOME

#Se codifica ID_INCOME a partir de Codigo_income
le_income = LabelEncoder()
le_income.fit(df['CODIGO_INCOME'])
df['ID_INCOME'] = le_income.transform(df['CODIGO_INCOME'])

#Se guarda la codificación
filehandler = open("le_income.obj","wb")
pickle.dump(le_income,filehandler)
filehandler.close()

write_pandas(conn, df, 'INCOME') # se ingesta el dataframe pd a la tabla INCOME

2022-10-25 00:48:20.790 query: [create temporary stage /* Python:snowflake.connector.pandas_tools.write_pandas()...]
2022-10-25 00:48:21.184 query execution done
2022-10-25 00:48:21.186 Number of results in first chunk: 1
2022-10-25 00:48:21.195 query: [PUT /* Python:snowflake.connector.pandas_tools.write_pandas() */ 'file://C:\\Use...]
2022-10-25 00:48:21.585 query execution done
2022-10-25 00:48:24.406 query: [COPY INTO "INCOME" /* Python:snowflake.connector.pandas_tools.write_pandas() */ ...]
2022-10-25 00:48:25.953 query execution done
2022-10-25 00:48:25.955 Number of results in first chunk: 1

(True,
 1,
 3,
 [('ftdyg/file0.txt', 'LOADED', 3, 3, 1, 0, None, None, None, None)])

Cargamos datos en la tabla INDICADOR

In [310]:
Indicador = ['Average precipitation in depth (mm per year)',
'emisiones de CO2 (kt)',
'crecimiento de la poblacion (% anual)',
'Educational attainment, at least completed primary, population 25+ years, female (%) (cumulative)',
'School enrollment, tertiary (% gross)',
'Tasa de alfabetizacion, total adultos (% de personas)',
'Hepatitis B (HepB3) immunization coverage among 1-year-olds (%)',
'Immunization, DPT (% of children ages 12-23 months)',
'Immunization, measles (% of children ages 12-23 months)',
'Incidence of HIV, all (per 1,000 uninfected population)',
'Mortality rate, under-5 (per 1,000 live births)',
'Number of deaths ages 5-9 years',
'Number of infant deaths (per 1,000 live births)',
'Polio (Pol3) immunization covergae among 1-year-olds (%)',
'prevalencia del consumo de tabaco, hombres',
'prevalencia del consumo de tabaco, mujeres',
'tasa de mortalidad materna (cada 100.000 nacidos vivos)',
'tasa de mortalidad menores de 5 años (por 1000nacidos vivos)',
'tasa de mortalidad, adultos hombres (por cada 1000 adultos)',
'tasa de mortalidad, adultos mujeres (por cada 1000 adultos)',
'Total alcohol consumption per capita (liters of pure alcohol, projected estimates, 15+ years of age)',
'Access to clean fuels and technologies for cooking, rural (% of rural population)',
'Current education expenditure, primary (% of total expenditure in primary public institutions)',
'Current health expenditure (% of GDP)',
'desempleo total (% de la poblacion laboral)',
'esperanza de vida al nacer, hombres (años)',
'esperanza de vida al nacer, muejres (años)',
'esperanza de vida al nacer, Total (años)',
'gasto publico (% del pib)',
'gasto publico en educación, total (% del pbi)',
'GDP per capita (constant 2015 US$)',
'poblacion que vive en barrios marginales (% de la poblacion urbana)',
'Población Rural (% de la poblacion total)',
'poblacion urbana (%poblacion total)',
'Research and development expenditure (% of GDP)',
'Researchers in R&D (per million people)',
'tasa de recuento de la pobreza, multidimensional (%de la poblacion total)',
'Trade in services (% of GDP)'
]
Code_Indicador = ['AG.LND.PRCP.MM',
'EN.ATM.CO2E.KT',
'SP.POP.GROW',
'SE.PRM.CUAT.FE.ZS',
'SE.TER.ENRR',
'SE.ADT.LITR.ZS',
'CSV1 from WHO',
'SH.IMM.IDPT',
'SH.IMM.MEAS',
'SH.HIV.INCD.TL.P3',
'SH.DYN.MORT',
'SH.DTH.0509',
'SH.DTH.IMRT.IN',
'CSV2 from WHO',
'SH.PRV.SMOK.MA',
'SH.PRV.SMOK.FE',
'SH.STA.MMRT',
'SH.DYN.MORT',
'SP.DYN.AMRT.MA',
'SP.DYN.AMRT.FE',
'SH.ALC.PCAP.LI',
'EG.CFT.ACCS.RU.ZS',
'SE.XPD.CPRM.ZS',
'SH.XPD.CHEX.GD.ZS',
'SL.UEM.TOTL.NE.ZS',
'SP.DYN.LE00.MA.IN',
'SP.DYN.LE00.FE.IN',
'SP.DYN.LE00.IN',
'GC.XPN.TOTL.GD.ZS',
'SE.XPD.TOTL.GD.ZS',
'NY.GDP.PCAP.KD',
'EN.POP.SLUM.UR.ZS',
'SP.RUR.TOTL.ZS',
'SP.URB.TOTL.IN.ZS',
'GB.XPD.RSDV.GD.ZS',
'SP.POP.SCIE.RD.P6',
'SI.POV.MDIM',
'BG.GSR.NFSV.GD.ZS'
]
#Se crea el df para la tabla INDICADOR
df=pd.DataFrame({'CODIGO':Code_Indicador,'DESCRIPCION':Indicador}) 

#Se codifica ID_INDICADOR a partir de CODIGO
le_indicador = LabelEncoder()
le_indicador.fit(df['CODIGO'])
df['ID_INDICADOR'] = le_indicador.transform(df['CODIGO'])

#Se guarda la codificación
filehandler = open("le_indicador.obj","wb")
pickle.dump(le_indicador,filehandler)
filehandler.close()

write_pandas(conn, df, 'INDICADOR') # se ingesta el dataframe pd a la tabla indicador

2022-10-25 00:48:31.598 query: [create temporary stage /* Python:snowflake.connector.pandas_tools.write_pandas()...]
2022-10-25 00:48:31.959 query execution done
2022-10-25 00:48:31.961 Number of results in first chunk: 1
2022-10-25 00:48:31.975 query: [PUT /* Python:snowflake.connector.pandas_tools.write_pandas() */ 'file://C:\\Use...]
2022-10-25 00:48:32.392 query execution done
2022-10-25 00:48:34.900 query: [COPY INTO "INDICADOR" /* Python:snowflake.connector.pandas_tools.write_pandas() ...]
2022-10-25 00:48:36.496 query execution done
2022-10-25 00:48:36.497 Number of results in first chunk: 1

(True,
 1,
 38,
 [('tnaml/file0.txt', 'LOADED', 38, 38, 1, 0, None, None, None, None)])

### Cargamos datos a la tabla de hechos

Ingestamos datos a la tabla de hechos sin los KPIs

In [311]:
Indicador_code_INCOMPLETE = ['AG.LND.PRCP.MM',
'EN.ATM.CO2E.KT',
'SP.POP.GROW',
'SE.PRM.CUAT.FE.ZS',
'SE.TER.ENRR',
'SE.ADT.LITR.ZS',
'CSV from WHO',
'SH.IMM.IDPT',
'SH.IMM.MEAS',
'SH.HIV.INCD.TL.P3',
'SH.DTH.0509',
'SH.DTH.IMRT.IN',
'CSV from WHO',
'SH.PRV.SMOK.MA',
'SH.PRV.SMOK.FE',
'SH.DYN.MORT',
'SP.DYN.AMRT.MA',
'SP.DYN.AMRT.FE',
'SH.ALC.PCAP.LI',
'EG.CFT.ACCS.RU.ZS',
'SE.XPD.CPRM.ZS',
'SH.XPD.CHEX.GD.ZS',
'SL.UEM.TOTL.NE.ZS',
'SP.DYN.LE00.MA.IN',
'SP.DYN.LE00.FE.IN',
'SE.XPD.TOTL.GD.ZS',
'EN.POP.SLUM.UR.ZS',
'SP.RUR.TOTL.ZS',
'SP.URB.TOTL.IN.ZS',
'GB.XPD.RSDV.GD.ZS',
'SP.POP.SCIE.RD.P6',
'SI.POV.MDIM',
'BG.GSR.NFSV.GD.ZS'
]
df2=wb.data.DataFrame(Indicador_code_INCOMPLETE, 
                  Nation_code, 
                  mrv= 30,
                  columns='series',
                  numericTimeKeys=True
                  )
df2=df2.reset_index()
df2=df2.melt(id_vars=['economy','time'], var_name="ID_INDICADOR", value_name="VALOR")

Ingesta a tabla de hechos los indicadores de KPIs diferenciando desde el año que existen datos

In [312]:
#Esperanza de vida desde 1960
EV61=wb.data.DataFrame('SP.DYN.LE00.IN', 
                  Nation_code, 
                  mrv= 61,
                  columns='series',
                  numericTimeKeys=True
                  )
EV61=EV61.reset_index()

In [313]:
#Ingreso per capita desde 1960
IPC62=wb.data.DataFrame('NY.GDP.PCAP.KD', 
                  Nation_code, 
                  mrv= 62,
                  columns='series',
                  numericTimeKeys=True
                  )
IPC62=IPC62.reset_index()
leftmerge=pd.merge(EV61,IPC62, how="left", on=['economy', 'time'] )

In [314]:
#Mortalidad materna desde 2000
MM18=wb.data.DataFrame('SH.STA.MMRT', 
                  Nation_code, 
                  mrv= 18,
                  columns='series',
                  numericTimeKeys=True
                  )
MM18=MM18.reset_index()
leftmerge=pd.merge(leftmerge,MM18, how="left", on=['economy', 'time'] )

In [315]:
#Inversion publica desde 1990
GS31=wb.data.DataFrame('GC.XPN.TOTL.GD.ZS', 
                  Nation_code, 
                  mrv= 31,
                  columns='series',
                  numericTimeKeys=True
                  )
GS31=GS31.reset_index()
leftmerge=pd.merge(leftmerge,GS31, how="left", on=['economy', 'time'] )

In [316]:
#GMortalidad infantil desde 1990
MC52=wb.data.DataFrame('SH.DYN.MORT', 
                  Nation_code, 
                  mrv= 52,
                  columns='series',
                  numericTimeKeys=True
                  )
MC52=MC52.reset_index()
leftmerge=pd.merge(leftmerge,MC52, how="left", on=['economy', 'time'] )

In [317]:
#Hacemos el melt de los datos para poder concatenar luego a la tabla de hechos
leftmerge=leftmerge.melt(id_vars=['economy','time'], var_name="ID_INDICADOR", value_name="VALOR")

In [318]:
#Agregamos los indicadores de KPI's a la tabla de hechos
hechos=pd.concat([df2,leftmerge])
#Renombramos las columnas economy y time
hechos=hechos.rename(columns={'economy':'CODIGO_PAIS','time':'ANIO'})

In [319]:
#Cargamos codificación guardada anteriormente para indicador
file = open("le_indicador.obj",'rb')
le_loaded = pickle.load(file)
file.close()
#transformamos ID_INDICADOR
hechos['ID_INDICADOR'] = le_loaded.transform(hechos['ID_INDICADOR'])

Creamos la columna Id_continente a partir de los países

In [320]:
lista_america=['ARG','CAN','MEX','USA','PAN','BRA','ARG','CHL','URY','BOL','PER','CRI']
lista_africa=['EGY','LBY','ZAF','NGA','MAR']
lista_asia=['CHN','IND','THA','JPN','KOR','ISR','SAU','MYS','IDN','RUS','TUR']
lista_europa=['ESP','BGR','FRA','ITA','DEU','GBR','NOR','SWE','GRC']
lista_oceania=['AUS']

def categoria_pais(row):
    if row['CODIGO_PAIS'] in lista_america:
        return "America"
    if row['CODIGO_PAIS'] in lista_europa:
        return "Europa"
    if row['CODIGO_PAIS'] in lista_asia:
        return "Asia"
    if row['CODIGO_PAIS'] in lista_africa:
        return "Africa"
    if row['CODIGO_PAIS'] in lista_oceania:
        return "Oceania"

hechos['CONTINENTE'] = hechos.apply(lambda row: categoria_pais(row), axis=1)

#Abrimos encoder guardado
file = open("le_conti.obj",'rb')
le_loaded = pickle.load(file)
file.close()

#Codificamos columna CONTINENTE como ID_CONTINENTE
hechos['ID_CONTINENTE'] = le_loaded.transform(hechos['CONTINENTE'])

#label_encoder = preprocessing.LabelEncoder()
#numero_indicador = label_encoder.fit_transform(hechos['CONTINENTE'])
#hechos['ID_CONTINENTE'] = hechos.apply(lambda row: numero_indicador(row), axis=1)
#hechos['ID_CONTINENTE'] = hechos.apply(lambda row: categoria_pais(row), axis=1)

Creamos la columna ID_INGRESO a partir de una lista y del nombre del pais

In [321]:
lista_alto=['CAN','USA','PAN','CHL','URY','AUS','JPN','KOR','ISR','SAU','ESP','FRA','ITA','DEU','GBR','NOR','SWE','GRC']
lista_medioalto=['ARG','MEX','BRA','ARG','CRI','PER','BGR','TUR','LBY','ZAF','RUS']
lista_mediobajo=['CHN','THA','MYS','BOL','EGY','NGA','MAR','IND','IDN']


def ingreso_pais(row):
    if row['CODIGO_PAIS'] in lista_alto:
        return 'H'
    if row['CODIGO_PAIS'] in lista_medioalto:
        return 'M'
    if row['CODIGO_PAIS'] in lista_mediobajo:
        return 'LM'
    
hechos['CODIGO_INCOME'] = hechos.apply(lambda row: ingreso_pais(row), axis=1)

#Abrimos encoder guardado
file = open("le_income.obj",'rb')
le_loaded = pickle.load(file)
file.close()

#Codificamos columna CONTINENTE como ID_CONTINENTE
hechos['ID_INCOME'] = le_loaded.transform(hechos['CODIGO_INCOME'])

Codificamos la columna ID_PAIS

In [322]:
#Abrimos encoder guardado
file = open("le_nation.obj",'rb')
le_loaded = pickle.load(file)
file.close()

#Codificamos columna CODIGO_PAIS como ID_PAIS
hechos['ID_PAIS'] = le_loaded.transform(hechos['CODIGO_PAIS'])

In [323]:
hechos=hechos.drop(columns=['CODIGO_PAIS','CONTINENTE', 'CODIGO_INCOME'])

In [324]:
hechos

       ANIO  ID_INDICADOR  VALOR  ID_CONTINENTE  ID_INCOME  ID_PAIS
0      1992             0  591.0              1          2        0
1      1993             0    NaN              1          2        0
2      1994             0    NaN              1          2        0
3      1995             0    NaN              1          2        0
4      1996             0    NaN              1          2        0
...     ...           ...    ...            ...        ...      ...
11280  2016            18   35.2              0          2       36
11281  2017            18   34.6              0          2       36
11282  2018            18   33.9              0          2       36
11283  2019            18   33.0              0          2       36
11284  2020            18   32.2              0          2       36

[44585 rows x 6 columns]

Cargamos lo indicadores "Hepatitis B", "Gasto en salud" y "Polio" desde un CSV descargado de la página de WHO

In [211]:
Hepa=pd.read_csv('https://raw.githubusercontent.com/grupohenryds03/esperanza_vida/main/datasets/HepatitisB.csv')

In [325]:
Countries = ['United States', 'Canada','Mexico','Costa Rica','Panama','Brazil','Argentina','Chile','Uruguay','Bolivia','Peru','Egypt, Arab Rep.','Libya','South Africa','Nigeria','Morocco','Australia','China','India','Thailand','Japan','Korea, Rep.','Israel','Saudi Arabia','Malaysia','Indonesia','Russian Federation','Turkiye','Spain','Bulgaria','France','Italy','Germany','United Kingdom','Norway','Sweden','Greece']
Nation_code= ['USA','CAN','MEX','CRI','PAN','BRA','ARG','CHL','URY','BOL','PER','EGY','LBY','ZAF','NGA','MAR','AUS','CHN','IND','THA','JPN','KOR','ISR','SAU','MYS','IDN','RUS','TUR','ESP','BGR','FRA','ITA','DEU','GBR','NOR','SWE','GRC']

Hepatitis=pd.DataFrame({2000:[],2001:[],2002:[],2003:[]})
for n in Nation_code:
    Hepa2=Hepa[['Location','Period', 'Value','SpatialDimValueCode']]
    Hepa2=Hepa2.loc[Hepa2['SpatialDimValueCode']==n]
    Hepa2=Hepa2.sort_values(by=['Period'])
    Hepa2=Hepa2.set_index('Period').T
    Hepa2=Hepa2.drop(['Location','SpatialDimValueCode'])
    Hepa2=Hepa2.rename(index={'Value':n})
    Hepatitis=pd.concat([Hepatitis,Hepa2])

Hepatitis=Hepatitis.reset_index()
Hepatitis=Hepatitis.melt(id_vars=['index'], var_name="ANIO", value_name="VALOR")
Hepatitis['ID_INDICADOR']=2
Hepatitis=Hepatitis.rename(columns={"index":"CODIGO_PAIS"})

In [215]:
Polio=pd.read_csv('https://raw.githubusercontent.com/grupohenryds03/esperanza_vida/main/datasets/Polio.csv')

In [326]:
Poliodf=pd.DataFrame({2000:[],2001:[],2002:[],2003:[]})
for n in Nation_code:
    Polio2=Polio[['Location','Period', 'Value', 'SpatialDimValueCode']]
    Polio2=Polio2.loc[Polio2['SpatialDimValueCode']==n]
    Polio2=Polio2.sort_values(by=['Period'])
    Polio2=Polio2.set_index('Period').T
    Polio2=Polio2.drop(['Location', 'SpatialDimValueCode' ])
    Polio2=Polio2.rename(index={'Value':n})
    Poliodf=pd.concat([Poliodf,Polio2])
    
Poliodf=Poliodf.reset_index()
Poliodf=Poliodf.melt(id_vars=['index'], var_name="ANIO", value_name="VALOR")
Poliodf['ID_INDICADOR']=3
Poliodf=Poliodf.rename(columns={"index":"CODIGO_PAIS"})

Concatenamos las tablas del WHO

In [327]:
WHO=pd.concat([Hepatitis,Poliodf])

Agregamos las columnas ID_CONTINENTE, ID_INCOME y ID_PAIS con el mismo criterio de la tabla Hechos

In [328]:
lista_america=['ARG','CAN','MEX','USA','PAN','BRA','ARG','CHL','URY','BOL','PER','CRI']
lista_africa=['EGY','LBY','ZAF','NGA','MAR']
lista_asia=['CHN','IND','THA','JPN','KOR','ISR','SAU','MYS','IDN','RUS','TUR']
lista_europa=['ESP','BGR','FRA','ITA','DEU','GBR','NOR','SWE','GRC']
lista_oceania=['AUS']

def categoria_pais(row):
    if row['CODIGO_PAIS'] in lista_america:
        return "America"
    if row['CODIGO_PAIS'] in lista_europa:
        return "Europa"
    if row['CODIGO_PAIS'] in lista_asia:
        return "Asia"
    if row['CODIGO_PAIS'] in lista_africa:
        return "Africa"
    if row['CODIGO_PAIS'] in lista_oceania:
        return "Oceania"

WHO['CONTINENTE'] = WHO.apply(lambda row: categoria_pais(row), axis=1)

#Abrimos encoder guardado
file = open("le_conti.obj",'rb')
le_loaded = pickle.load(file)
file.close()

#Codificamos columna CONTINENTE como ID_CONTINENTE
WHO['ID_CONTINENTE'] = le_loaded.transform(WHO['CONTINENTE'])


lista_alto=['CAN','USA','PAN','CHL','URY','AUS','JPN','KOR','ISR','SAU','ESP','FRA','ITA','DEU','GBR','NOR','SWE','GRC']
lista_medioalto=['ARG','MEX','BRA','ARG','CRI','PER','BGR','TUR','LBY','ZAF','RUS']
lista_mediobajo=['CHN','THA','MYS','BOL','EGY','NGA','MAR','IND','IDN']

def ingreso_pais(row):
    if row['CODIGO_PAIS'] in lista_alto:
        return 'H'
    if row['CODIGO_PAIS'] in lista_medioalto:
        return 'M'
    if row['CODIGO_PAIS'] in lista_mediobajo:
        return 'LM'
    
WHO['CODIGO_INCOME'] = WHO.apply(lambda row: ingreso_pais(row), axis=1)

#Abrimos encoder guardado
file = open("le_income.obj",'rb')
le_loaded = pickle.load(file)
file.close()

#Codificamos columna INCOME como ID_INCOME
WHO['ID_INCOME'] = le_loaded.transform(WHO['CODIGO_INCOME'])

#Abrimos encoder guardado
file = open("le_nation.obj",'rb')
le_loaded = pickle.load(file)
file.close()

#Codificamos columna CODIGO_PAIS como ID_PAIS
WHO['ID_PAIS'] = le_loaded.transform(WHO['CODIGO_PAIS'])

In [329]:
WHO=WHO.drop(columns=['CODIGO_PAIS','CONTINENTE','CODIGO_INCOME'])

In [330]:
WHO.head()

   ANIO VALOR  ID_INDICADOR  ID_CONTINENTE  ID_INCOME  ID_PAIS
0  2000    90             2              1          0       35
1  2000   NaN             2              1          0        5
2  2000    97             2              1          2       23
3  2000    89             2              1          2        8
4  2000   NaN             2              1          0       27

Concatenamos las tabla WHO con la tabla de hechos

In [331]:
hechos=pd.concat([hechos,WHO])

In [332]:
hechos

     ANIO  ID_INDICADOR  VALOR  ID_CONTINENTE  ID_INCOME  ID_PAIS
0    1992             0  591.0              1          2        0
1    1993             0    NaN              1          2        0
2    1994             0    NaN              1          2        0
3    1995             0    NaN              1          2        0
4    1996             0    NaN              1          2        0
..    ...           ...    ...            ...        ...      ...
809  2021             3     91              3          0        9
810  2021             3     93              3          0       13
811  2021             3     97              3          0       26
812  2021             3     98              3          0       31
813  2021             3     99              3          0       14

[46213 rows x 6 columns]

Cargamos los datos de la tabla hechos a la tabla EV de snowflake

In [333]:
write_pandas(conn, hechos, 'EV') # se ingesta el dataframe pd a la tabla EV
# se cortan las conexiones
conn.close()

2022-10-25 00:53:40.729 query: [create temporary stage /* Python:snowflake.connector.pandas_tools.write_pandas()...]
2022-10-25 00:53:42.499 query execution done
2022-10-25 00:53:42.500 Number of results in first chunk: 1
2022-10-25 00:53:42.665 query: [PUT /* Python:snowflake.connector.pandas_tools.write_pandas() */ 'file://C:\\Use...]
2022-10-25 00:53:43.048 query execution done
2022-10-25 00:53:46.283 query: [COPY INTO "EV" /* Python:snowflake.connector.pandas_tools.write_pandas() */ ("AN...]
2022-10-25 00:53:48.133 query execution done
2022-10-25 00:53:48.135 Number of results in first chunk: 1
2022-10-25 00:53:48.137 closed
2022-10-25 00:53:48.364 No async queries seem to be running, deleting session

In [211]:
#hechos.to_csv('hechos_1.csv', index=False)

### Hacemos consultas

In [6]:
#se crea conexión
cnn = snowflake.connector.connect(
    user='grupods03',
    password='Henry2022#',
    account='nr28668.sa-east-1.aws',
    warehouse='DW_EV',
    database="LAKE")
    #role ='ACCOUNTADMIN',
    #schema ='PUBLIC')

In [ ]:
#se crea conexión
cnn1 = snowflake.connector.connect(
    user=st.secrets.snowflake.user,
    password=st.secrets.snowflake.password,
    account=st.secrets.snowflake.account,
    warehouse=st.secrets.snowflake.warehouse,
    database=st.secrets.snowflake.database)
    #role ='ACCOUNTADMIN',
    #schema ='PUBLIC')

In [17]:
sql="SELECT * FROM PAIS"
pais=pd.read_sql(sql,cnn)
pais.head()

c:\Users\Jhovany Lara\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:758: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(
2022-10-24 12:41:14.134 query: [SELECT * FROM PAIS]
2022-10-24 12:41:16.869 query execution done
2022-10-24 12:41:16.873 Number of results in first chunk: 37

   ID_PAIS CODIGO_PAIS     NOMBRE
0        0         ARG  Argentina
1        1         AUS  Australia
2        2         BGR   Bulgaria
3        3         BOL    Bolivia
4        4         BRA     Brazil

In [38]:
Dicc_id_pais=pd.Series(pais.ID_PAIS.values,index=pais.CODIGO_PAIS).to_dict()
Dicc_id_pais

{'ARG': 0,
 'AUS': 1,
 'BGR': 4,
 'BOL': 2,
 'BRA': 3,
 'CAN': 5,
 'CHL': 6,
 'CHN': 7,
 'CRI': 8,
 'DEU': 11,
 'EGY': 9,
 'ESP': 30,
 'FRA': 10,
 'GBR': 34,
 'GRC': 12,
 'IDN': 14,
 'IND': 13,
 'ISR': 15,
 'ITA': 16,
 'JPN': 17,
 'KOR': 18,
 'LBY': 19,
 'MAR': 22,
 'MEX': 21,
 'MYS': 20,
 'NGA': 23,
 'NOR': 24,
 'PAN': 25,
 'PER': 26,
 'RUS': 27,
 'SAU': 28,
 'SWE': 31,
 'THA': 32,
 'TUR': 33,
 'URY': 36,
 'USA': 35,
 'ZAF': 29}

In [ ]:
Dicc_pais=pd.Series(pais.NOMBRE.values,index=pais.ID_PAIS).to_dict()
Dicc_pais

In [6]:
pais.to_csv('Incomplete.csv')

In [23]:
sql="SELECT * FROM INDICADOR "
indic=pd.read_sql(sql,cnn)
indic.head()

c:\Users\Jhovany Lara\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:758: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(
2022-10-24 12:58:57.761 query: [SELECT * FROM INDICADOR]
2022-10-24 12:59:00.476 query execution done
2022-10-24 12:59:00.478 Number of results in first chunk: 38

,ID_INDICADOR,CODIGO,DESCRIPCION
0,1,AG.LND.PRCP.MM,Average precipitation in depth (mm per year)
1,2,EN.ATM.CO2E.KT,emisiones de CO2 (kt)
2,3,SP.POP.GROW,crecimiento de la poblacion (% anual)
3,4,SE.PRM.CUAT.FE.ZS,"Educational attainment, at least completed pri..."
4,5,SE.TER.ENRR,"School enrollment, tertiary (% gross)"

In [24]:
label_encoder = preprocessing.LabelEncoder()
indic['ID_INDICADOR'] = label_encoder.fit_transform(indic['CODIGO'])
indic.head()

,ID_INDICADOR,CODIGO,DESCRIPCION
0,0,AG.LND.PRCP.MM,Average precipitation in depth (mm per year)
1,4,EN.ATM.CO2E.KT,emisiones de CO2 (kt)
2,32,SP.POP.GROW,crecimiento de la poblacion (% anual)
3,10,SE.PRM.CUAT.FE.ZS,"Educational attainment, at least completed pri..."
4,11,SE.TER.ENRR,"School enrollment, tertiary (% gross)"

In [39]:
Dic_indicador=pd.Series(indic.CODIGO.values,index=indic.ID_INDICADOR).to_dict()
Dic_indicador

{0: 'AG.LND.PRCP.MM',
 4: 'EN.ATM.CO2E.KT',
 32: 'SP.POP.GROW',
 10: 'SE.PRM.CUAT.FE.ZS',
 11: 'SE.TER.ENRR',
 9: 'SE.ADT.LITR.ZS',
 2: 'CSV from WHO',
 19: 'SH.IMM.IDPT',
 20: 'SH.IMM.MEAS',
 18: 'SH.HIV.INCD.TL.P3',
 17: 'SH.DYN.MORT',
 15: 'SH.DTH.0509',
 16: 'SH.DTH.IMRT.IN',
 22: 'SH.PRV.SMOK.MA',
 21: 'SH.PRV.SMOK.FE',
 23: 'SH.STA.MMRT',
 28: 'SP.DYN.AMRT.MA',
 27: 'SP.DYN.AMRT.FE',
 14: 'SH.ALC.PCAP.LI',
 3: 'EG.CFT.ACCS.RU.ZS',
 12: 'SE.XPD.CPRM.ZS',
 24: 'SH.XPD.CHEX.GD.ZS',
 26: 'SL.UEM.TOTL.NE.ZS',
 31: 'SP.DYN.LE00.MA.IN',
 29: 'SP.DYN.LE00.FE.IN',
 30: 'SP.DYN.LE00.IN',
 7: 'GC.XPN.TOTL.GD.ZS',
 13: 'SE.XPD.TOTL.GD.ZS',
 8: 'NY.GDP.PCAP.KD',
 5: 'EN.POP.SLUM.UR.ZS',
 34: 'SP.RUR.TOTL.ZS',
 35: 'SP.URB.TOTL.IN.ZS',
 6: 'GB.XPD.RSDV.GD.ZS',
 33: 'SP.POP.SCIE.RD.P6',
 25: 'SI.POV.MDIM',
 1: 'BG.GSR.NFSV.GD.ZS'}

In [27]:
sql="SELECT * FROM INCOME "
income=pd.read_sql(sql,cnn)
income.head()

c:\Users\Jhovany Lara\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:758: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(
2022-10-24 13:03:42.545 query: [SELECT * FROM INCOME]
2022-10-24 13:03:45.071 query execution done
2022-10-24 13:03:45.074 Number of results in first chunk: 3

   ID_INCOME CODIGO_INCOME              INCOME
0          0             H        Alto ingreso
1          2             M  Ingreso medio alto
2          1            LM  Ingreso medio bajo

In [28]:
label_encoder = preprocessing.LabelEncoder()
income['ID_INCOME'] = label_encoder.fit_transform(income['CODIGO_INCOME'])
income.head()

   ID_INCOME CODIGO_INCOME              INCOME
0          0             H        Alto ingreso
1          2             M  Ingreso medio alto
2          1            LM  Ingreso medio bajo

In [40]:
Dic_incom=pd.Series(income.INCOME.values,index=income.ID_INCOME).to_dict()
Dic_incom

{0: 'Alto ingreso', 2: 'Ingreso medio alto', 1: 'Ingreso medio bajo'}

In [31]:
sql="SELECT * FROM CONTINENTE "
contin=pd.read_sql(sql,cnn)
contin.head()

c:\Users\Jhovany Lara\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:758: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(
2022-10-24 13:07:21.949 query: [SELECT * FROM CONTINENTE]
2022-10-24 13:07:24.450 query execution done
2022-10-24 13:07:24.452 Number of results in first chunk: 5

   ID_CONTINENTE CONTINENTE
0              1    America
1              2     Europa
2              3       Asia
3              4     Africa
4              5    Oceania

In [32]:
label_encoder = preprocessing.LabelEncoder()
contin['ID_CONTINENTE'] = label_encoder.fit_transform(contin['CONTINENTE'])
contin.head()

   ID_CONTINENTE CONTINENTE
0              1    America
1              3     Europa
2              2       Asia
3              0     Africa
4              4    Oceania

In [41]:
Dic_contin=pd.Series(contin.CONTINENTE.values,index=contin.ID_CONTINENTE).to_dict()
Dic_contin

{1: 'America', 3: 'Europa', 2: 'Asia', 0: 'Africa', 4: 'Oceania'}

In [44]:
dfcont = pd.DataFrame(Dic_contin.items(), columns=['ID_CONTINENTE', 'CONTINENTE']) # se crea dataframe con pandas
dfcont

   ID_CONTINENTE CONTINENTE
0              1    America
1              3     Europa
2              2       Asia
3              0     Africa
4              4    Oceania

In [ ]:
from sklearn.preprocessing import OneHotEncoder
paiscode=OneHotEncoder()

In [7]:
sql="SELECT * FROM EV"
ALL2=pd.read_sql(sql,cnn)
ALL2.head()

c:\Users\Jhovany Lara\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:758: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   ID_PAIS  ANIO  ID_INDICADOR  VALOR  ID_CONTINENTE  ID_INCOME
0        0  1992            38   3.71              1          2
1        0  1993            38   3.96              1          2
2        0  1994            38   4.06              1          2
3        0  1995            38   4.28              1          2
4        0  1996            38   4.53              1          2

In [8]:
ALL2.to_csv('Complete.csv')

In [17]:
sql ="""SELECT p.CODIGO_PAIS, e.ANIO, e.VALOR, i.DESCRIPCION as INDICADOR 
        FROM EV e 
        JOIN INDICADOR i 
        ON (e.ID_INDICADOR=i.ID_INDICADOR)
        JOIN PAIS p
        on (e.ID_PAIS=p.ID_PAIS)
        WHERE e.ID_INDICADOR=28 AND e.ANIO>1960 AND e.ANIO<=2020  """
probando=pd.read_sql(sql,cnn)
#AND e.ANIO>1960 AND e.ANIO<=2020

c:\Users\Jhovany Lara\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:758: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [18]:
probando

     CODIGO_PAIS  ANIO  VALOR                                 INDICADOR
0            ARG  1992  72.03  esperanza de vida al nacer, Total (años)
1            ARG  1993  72.25  esperanza de vida al nacer, Total (años)
2            ARG  1994  72.45  esperanza de vida al nacer, Total (años)
3            ARG  1995  72.65  esperanza de vida al nacer, Total (años)
4            ARG  1996  72.84  esperanza de vida al nacer, Total (años)
...          ...   ...    ...                                       ...
1068         ZAF  2016  63.15  esperanza de vida al nacer, Total (años)
1069         ZAF  2017  63.54  esperanza de vida al nacer, Total (años)
1070         ZAF  2018  63.86  esperanza de vida al nacer, Total (años)
1071         ZAF  2019  64.13  esperanza de vida al nacer, Total (años)
1072         ZAF  2020  64.38  esperanza de vida al nacer, Total (años)

[1073 rows x 4 columns]

In [11]:
#Consulta todos los países con indicador 2 --> Se hizo doble JOIN <--
sql ="""SELECT e.ID_PAIS, e.ANIO, e.VALOR, i.DESCRIPCION as INDICADOR 
    FROM EV e 
    JOIN INDICADOR i 
    ON (e.ID_INDICADOR=i.ID_INDICADOR) 
    WHERE e.ID_INDICADOR=28 AND e.ANIO>1960 AND e.ANIO<=2020 AND e.ID_PAIS=0""" 
arg=pd.read_sql(sql,cnn)

c:\Users\Jhovany Lara\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:758: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [12]:
arg

    ID_PAIS  ANIO  VALOR                                 INDICADOR
0         0  1992  72.03  esperanza de vida al nacer, Total (años)
1         0  1993  72.25  esperanza de vida al nacer, Total (años)
2         0  1994  72.45  esperanza de vida al nacer, Total (años)
3         0  1995  72.65  esperanza de vida al nacer, Total (años)
4         0  1996  72.84  esperanza de vida al nacer, Total (años)
5         0  1997  73.03  esperanza de vida al nacer, Total (años)
6         0  1998  73.21  esperanza de vida al nacer, Total (años)
7         0  1999  73.40  esperanza de vida al nacer, Total (años)
8         0  2000  73.58  esperanza de vida al nacer, Total (años)
9         0  2001  73.76  esperanza de vida al nacer, Total (años)
10        0  2002  73.93  esperanza de vida al nacer, Total (años)
11        0  2003  74.11  esperanza de vida al nacer, Total (años)
12        0  2004  74.28  esperanza de vida al nacer, Total (años)
13        0  2005  74.45  esperanza de vida al nacer, Total (años)
14        0  2006  74.62  esperanza de vida al nacer, Total (años)
15        0  2007  74.79  esperanza de vida al nacer, Total (años)
16        0  2008  74.95  esperanza de vida al nacer, Total (años)
17        0  2009  75.12  esperanza de vida al nacer, Total (años)
18        0  2010  75.28  esperanza de vida al nacer, Total (años)
19        0  2011  75.44  esperanza de vida al nacer, Total (años)
20        0  2012  75.60  esperanza de vida al nacer, Total (años)
21        0  2013  75.76  esperanza de vida al nacer, Total (años)
22        0  2014  75.91  esperanza de vida al nacer, Total (años)
23        0  2015  76.07  esperanza de vida al nacer, Total (años)
24        0  2016  76.22  esperanza de vida al nacer, Total (años)
25        0  2017  76.37  esperanza de vida al nacer, Total (años)
26        0  2018  76.52  esperanza de vida al nacer, Total (años)
27        0  2019  76.67  esperanza de vida al nacer, Total (años)
28        0  2020  76.81  esperanza de vida al nacer, Total (años)

In [62]:
w=arg['VALOR'].tolist()
w

[72.032,
 72.246,
 72.453,
 72.651,
 72.843,
 73.029,
 73.213,
 73.396,
 73.576,
 73.755,
 73.932,
 74.107,
 74.28,
 74.451,
 74.62,
 74.787,
 74.952,
 75.116,
 75.278,
 75.439,
 75.598,
 75.756,
 75.913,
 76.068,
 76.221,
 76.372,
 76.52,
 76.667,
 76.813]

In [53]:
df=df.pivot(index=['ID_PAIS', 'INDICADOR'], columns='ANIO')

In [54]:
arg2

                                                   VALOR                  \
ANIO                                                1992    1993    1994
ID_PAIS INDICADOR
ARG     esperanza de vida al nacer, Total (años)  72.032  72.246  72.453

                                                                          \
ANIO                                                1995    1996    1997
ID_PAIS INDICADOR
ARG     esperanza de vida al nacer, Total (años)  72.651  72.843  73.029

                                                                          \
ANIO                                                1998    1999    2000
ID_PAIS INDICADOR
ARG     esperanza de vida al nacer, Total (años)  73.213  73.396  73.576

                                                          ...                  \
ANIO                                                2001  ...    2011    2012
ID_PAIS INDICADOR                                         ...
ARG     esperanza de vida al nacer, Total (años)  73.755  ...  75.439  75.598

                                                                          \
ANIO                                                2013    2014    2015
ID_PAIS INDICADOR
ARG     esperanza de vida al nacer, Total (años)  75.756  75.913  76.068

                                                                         \
ANIO                                                2016    2017   2018
ID_PAIS INDICADOR
ARG     esperanza de vida al nacer, Total (años)  76.221  76.372  76.52


ANIO                                                2019    2020
ID_PAIS INDICADOR
ARG     esperanza de vida al nacer, Total (años)  76.667  76.813

[1 rows x 29 columns]

In [57]:
#Consulta todos los países con indicador 2 --> Se hizo doble JOIN <--
sql ="SELECT p.NOMBRE, e.ANIO, e.VALOR, i.CODIGO as INDICADOR FROM EV e JOIN PAIS p ON (e.ID_PAIS=p.ID_PAIS) JOIN INDICADOR i ON (e.ID_INDICADOR=i.ID_INDICADOR) WHERE e.ID_INDICADOR=2" 
Indicador2=pd.read_sql(sql,cnn)

c:\Users\Jhovany Lara\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:758: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [58]:
Indicador2

            NOMBRE  ANIO        VALOR       INDICADOR
0        Argentina  1992  107930.0000  EN.ATM.CO2E.KT
1        Argentina  1992  107930.0000  EN.ATM.CO2E.KT
2        Argentina  1993  110260.0000  EN.ATM.CO2E.KT
3        Argentina  1993  110260.0000  EN.ATM.CO2E.KT
4        Argentina  1994  111910.0000  EN.ATM.CO2E.KT
...            ...   ...          ...             ...
2215  South Africa  2019  439640.0146  EN.ATM.CO2E.KT
2216  South Africa  2020  219820.6440  EN.ATM.CO2E.KT
2217  South Africa  2020  219820.6440  EN.ATM.CO2E.KT
2218  South Africa  2021       1.2473  EN.ATM.CO2E.KT
2219  South Africa  2021       1.2473  EN.ATM.CO2E.KT

[2220 rows x 4 columns]

In [60]:
mun2=Indicador2.pivot(index=['NOMBRE', 'INDICADOR'], columns='ANIO')
mun2

ValueError: Index contains duplicate entries, cannot reshape

In [31]:
#Consulta un país (ARG) con indicador 2 en letra --> Se hizo doble JOIN <--
sql ="SELECT p.NOMBRE, e.ANIO, e.VALOR, i.DESCRIPCION FROM EV e JOIN PAIS p ON (e.ID_PAIS=p.ID_PAIS) JOIN INDICADOR i ON (e.ID_INDICADOR=i.ID_INDICADOR) WHERE e.ID_INDICADOR=2 AND e.ID_PAIS='ARG'" 
Indicador2ARG_LETRA=pd.read_sql(sql,cnn)

c:\Users\Jhovany Lara\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:758: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [33]:
Indicador2ARG_LETRA

       NOMBRE  ANIO          VALOR            DESCRIPCION
0   Argentina  1992  107930.000000  emisiones de CO2 (kt)
1   Argentina  1992  107930.000000  emisiones de CO2 (kt)
2   Argentina  1993  110260.000000  emisiones de CO2 (kt)
3   Argentina  1993  110260.000000  emisiones de CO2 (kt)
4   Argentina  1994  111910.000000  emisiones de CO2 (kt)
5   Argentina  1994  111910.000000  emisiones de CO2 (kt)
6   Argentina  1995  112890.000000  emisiones de CO2 (kt)
7   Argentina  1995  112890.000000  emisiones de CO2 (kt)
8   Argentina  1996  122550.000000  emisiones de CO2 (kt)
9   Argentina  1996  122550.000000  emisiones de CO2 (kt)
10  Argentina  1997  126120.000000  emisiones de CO2 (kt)
11  Argentina  1997  126120.000000  emisiones de CO2 (kt)
12  Argentina  1998  132670.000000  emisiones de CO2 (kt)
13  Argentina  1998  132670.000000  emisiones de CO2 (kt)
14  Argentina  1999  134510.000000  emisiones de CO2 (kt)
15  Argentina  1999  134510.000000  emisiones de CO2 (kt)
16  Argentina  2000  132270.000000  emisiones de CO2 (kt)
17  Argentina  2000  132270.000000  emisiones de CO2 (kt)
18  Argentina  2001  125260.000000  emisiones de CO2 (kt)
19  Argentina  2001  125260.000000  emisiones de CO2 (kt)
20  Argentina  2002  117470.001221  emisiones de CO2 (kt)
21  Argentina  2002  117470.001221  emisiones de CO2 (kt)
22  Argentina  2003  127660.003662  emisiones de CO2 (kt)
23  Argentina  2003  127660.003662  emisiones de CO2 (kt)
24  Argentina  2004  141380.004883  emisiones de CO2 (kt)
25  Argentina  2004  141380.004883  emisiones de CO2 (kt)
26  Argentina  2005  145990.005493  emisiones de CO2 (kt)
27  Argentina  2005  145990.005493  emisiones de CO2 (kt)
28  Argentina  2006  154899.993896  emisiones de CO2 (kt)
29  Argentina  2006  154899.993896  emisiones de CO2 (kt)
30  Argentina  2007  162809.997559  emisiones de CO2 (kt)
31  Argentina  2007  162809.997559  emisiones de CO2 (kt)
32  Argentina  2008  167229.995728  emisiones de CO2 (kt)
33  Argentina  2008  167229.995728  emisiones de CO2 (kt)
34  Argentina  2009  156570.007324  emisiones de CO2 (kt)
35  Argentina  2009  156570.007324  emisiones de CO2 (kt)
36  Argentina  2010  167220.001221  emisiones de CO2 (kt)
37  Argentina  2010  167220.001221  emisiones de CO2 (kt)
38  Argentina  2011  176639.999390  emisiones de CO2 (kt)
39  Argentina  2011  176639.999390  emisiones de CO2 (kt)
40  Argentina  2012  177960.006714  emisiones de CO2 (kt)
41  Argentina  2012  177960.006714  emisiones de CO2 (kt)
42  Argentina  2013  183250.000000  emisiones de CO2 (kt)
43  Argentina  2013  183250.000000  emisiones de CO2 (kt)
44  Argentina  2014  179600.006104  emisiones de CO2 (kt)
45  Argentina  2014  179600.006104  emisiones de CO2 (kt)
46  Argentina  2015  185550.003052  emisiones de CO2 (kt)
47  Argentina  2015  185550.003052  emisiones de CO2 (kt)
48  Argentina  2016  183160.003662  emisiones de CO2 (kt)
49  Argentina  2016  183160.003662  emisiones de CO2 (kt)
50  Argentina  2017  179320.007324  emisiones de CO2 (kt)
51  Argentina  2017  179320.007324  emisiones de CO2 (kt)
52  Argentina  2018  176899.993896  emisiones de CO2 (kt)
53  Argentina  2018  176899.993896  emisiones de CO2 (kt)
54  Argentina  2019  168100.006104  emisiones de CO2 (kt)
55  Argentina  2019  168100.006104  emisiones de CO2 (kt)
56  Argentina  2020            NaN  emisiones de CO2 (kt)
57  Argentina  2020            NaN  emisiones de CO2 (kt)
58  Argentina  2021            NaN  emisiones de CO2 (kt)
59  Argentina  2021            NaN  emisiones de CO2 (kt)

In [36]:
cnn.close